spring-soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:calculatorRequest>
            <gs:a>7</gs:a>
            <gs:b>5</gs:b>
            <gs:operator>^</gs:operator>
        </gs:calculatorRequest>
    </soapenv:Body>
</soapenv:Envelope>